src/InformationRegisters/СвязиЖурнала/СвязиЖурнала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиЖурнала</name>
  <dimensions>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаписьЖурнала</name>
    <type>
      <types>DocumentRef.ЗаписьЖурнала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.СущностиКампании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗаписьЖурнала/ЗаписьЖурнала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьЖурнала</name>
  <posting>Deny</posting>
  <attributes>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгроваяМинута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/СвязиЖурнала/Module.bsl
// Прикладная логика работы со связями записей журнала с игровыми сущностями.
// Все операции записи и чтения регистра СвязиЖурнала должны
// выполняться через данный модуль.

#Область ПрограммныйИнтерфейс

// Добавляет связь между записью журнала и игровой сущностью активной кампании.
//
// Параметры:
//  ЗаписьЖурнала - ДокументСсылка.ЗаписьЖурнала
//  Объект        - ОпределяемыйТип.СущностиКампании
//
Процедура ДобавитьСвязь(ЗаписьЖурнала, Объект) Экспорт

	АктивнаяКампания = АктивнаяКампания();

	ПроверитьВозможностьСвязи(ЗаписьЖурнала, Объект, АктивнаяКампания);

	КлючЗаписи = Новый Структура;
	КлючЗаписи.Вставить("Кампания", АктивнаяКампания);
	КлючЗаписи.Вставить("ЗаписьЖурнала", ЗаписьЖурнала);
	КлючЗаписи.Вставить("Объект", Объект);

	Если РегистрыСведений.СвязиЖурнала.Получить(КлючЗаписи) <> Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Связь между записью журнала и объектом уже существует.'");
	КонецЕсли;

	ЗаписьРегистра = РегистрыСведений.СвязиЖурнала.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Кампания = АктивнаяКампания;
	ЗаписьРегистра.ЗаписьЖурнала = ЗаписьЖурнала;
	ЗаписьРегистра.Объект = Объект;
	ЗаписьРегистра.Записать();

КонецПроцедуры

// Удаляет связь между записью журнала и игровой сущностью активной кампании.
// Если связь не найдена - исключение не возникает.
//
// Параметры:
//  ЗаписьЖурнала - ДокументСсылка.ЗаписьЖурнала
//  Объект        - ОпределяемыйТип.СущностиКампании
//
Процедура УдалитьСвязь(ЗаписьЖурнала, Объект) Экспорт

	Если НЕ ЗначениеЗаполнено(АктивнаяКампания()) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания.'");
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.СвязиЖурнала.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(АктивнаяКампания());
	НаборЗаписей.Отбор.ЗаписьЖурнала.Установить(ЗаписьЖурнала);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Записать();

КонецПроцедуры

// Возвращает список игровых сущностей, связанных с указанной записью журнала.
//
// Параметры:
//  ЗаписьЖурнала - ДокументСсылка.ЗаписьЖурнала
//
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.СущностиКампании
//
Функция ПолучитьОбъекты(ЗаписьЖурнала) Экспорт

	Результат = Новый Массив;

	Если НЕ ЗначениеЗаполнено(ЗаписьЖурнала) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания());
	Запрос.УстановитьПараметр("ЗаписьЖурнала", ЗаписьЖурнала);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвязиЖурнала.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.СвязиЖурнала КАК СвязиЖурнала
		|ГДЕ
		|	СвязиЖурнала.Кампания = &Кампания
		|	И СвязиЖурнала.ЗаписьЖурнала = &ЗаписьЖурнала";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Объект);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает записи журнала активной кампании, связанные с указанным
// объектом, от новых к старым. Помеченные на удаление записи не возвращаются.
//
// Параметры:
//  Объект     - ОпределяемыйТип.СущностиКампании
//  Количество - Число - максимальное количество возвращаемых записей.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗаписьЖурнала
//
Функция ПолучитьЗаписиПоОбъекту(Объект, Количество = 50) Экспорт

	Результат = Новый Массив;

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания());
	Запрос.УстановитьПараметр("Объект", Объект);
	ШаблонЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ &Количество
		|	СвязиЖурнала.ЗаписьЖурнала КАК ЗаписьЖурнала
		|ИЗ
		|	РегистрСведений.СвязиЖурнала КАК СвязиЖурнала
		|ГДЕ
		|	СвязиЖурнала.Кампания = &Кампания
		|	И СвязиЖурнала.Объект = &Объект
		|	И НЕ СвязиЖурнала.ЗаписьЖурнала.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СвязиЖурнала.ЗаписьЖурнала.Дата УБЫВ";
	Запрос.Текст = СтрЗаменить(ШаблонЗапроса, "&Количество", Формат(Количество, "ЧГ="));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ЗаписьЖурнала);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает активную кампанию из параметров сеанса.
//
// Возвращаемое значение:
//  СправочникСсылка.Кампании
//
Функция АктивнаяКампания()

	Возврат ПараметрыСеанса.АктивнаяКампания;

КонецФункции

// Проверяет значение на принадлежность определяемому типу "СущностиКампании".
//
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоСущностьКампании(Значение)

	Возврат Метаданные.ОпределяемыеТипы.СущностиКампании.Тип.СодержитТип(ТипЗнч(Значение));

КонецФункции

// Возвращает кампанию-владельца переданной игровой сущности.
// Все справочники определяемого типа "СущностиКампании" имеют
// владельца - справочник "Кампании".
//
// Параметры:
//  Объект - ОпределяемыйТип.СущностиКампании
//
// Возвращаемое значение:
//  СправочникСсылка.Кампании
//
Функция ПолучитьКампаниюОбъекта(Объект)

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, "Владелец");
	Возврат ЗначенияРеквизитов.Владелец;

КонецФункции

// Возвращает кампанию указанной записи журнала.
// Если запись журнала не найдена - вызывается исключение.
//
// Параметры:
//  ЗаписьЖурнала - ДокументСсылка.ЗаписьЖурнала
//
// Возвращаемое значение:
//  СправочникСсылка.Кампании
//
Функция ПолучитьКампаниюЗаписиЖурнала(ЗаписьЖурнала)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаписьЖурнала", ЗаписьЖурнала);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаписьЖурнала.Кампания КАК Кампания
		|ИЗ
		|	Документ.ЗаписьЖурнала КАК ЗаписьЖурнала
		|ГДЕ
		|	ЗаписьЖурнала.Ссылка = &ЗаписьЖурнала";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Запись журнала не найдена.'");
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Кампания;

КонецФункции

// Комплексная проверка возможности создания связи между записью журнала и объектом.
//
// Параметры:
//  ЗаписьЖурнала     - ДокументСсылка.ЗаписьЖурнала
//  Объект            - ОпределяемыйТип.СущностиКампании
//  АктивнаяКампания  - СправочникСсылка.Кампании
//
Процедура ПроверитьВозможностьСвязи(ЗаписьЖурнала, Объект, АктивнаяКампания)

	Если НЕ ЗначениеЗаполнено(АктивнаяКампания) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Операция со связями журнала невозможна.'");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЗаписьЖурнала) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана запись журнала.'");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан объект.'");
	КонецЕсли;

	Если НЕ ЭтоСущностьКампании(Объект) Тогда
		ВызватьИсключение НСтр("ru = 'Объект не входит в определяемый тип игровых сущностей.'");
	КонецЕсли;

	Если ПолучитьКампаниюЗаписиЖурнала(ЗаписьЖурнала) <> АктивнаяКампания Тогда
		ВызватьИсключение НСтр("ru = 'Запись журнала не относится к активной кампании.'");
	КонецЕсли;

	Если ПолучитьКампаниюОбъекта(Объект) <> АктивнаяКампания Тогда
		ВызватьИсключение НСтр("ru = 'Объект не относится к активной кампании.'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
